src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКурьерскойКомпанииПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ДвиженияДенежныхСредствВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// "Денежные средства" 
// 
// Общие серверные процедуры и функции для вызова с клиента из документов РасходСоСчета, РасходИзКассы,
// ПоступлениеНаСчет, ПоступлениеВКассу
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПоступлениеДС

Функция ПолучитьНовоеЗначениеСтатьиДДСПоступления(ВидОперацииПрочееПоступление, СтатьяДДС, СтатьяДДСВходящий, СтатьяДДСИсходящий) Экспорт
	
	НоваяСтатьяДДС = СтатьяДДС;
	
	Если (СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		ИЛИ СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
		ИЛИ НЕ ЗначениеЗаполнено(СтатьяДДС)) Тогда
		
		Если ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам);
		Иначе
			Возврат Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НоваяСтатьяДДС;
	
КонецФункции

#КонецОбласти

#Область РасходДС

Функция ПолучитьНовоеЗначениеСтатьиДДССписания(ВидОперацииПрочееСписание, СтатьяДДС, СтатьяДДСВходящий, СтатьяДДСИсходящий) Экспорт
	
	НоваяСтатьяДДС = СтатьяДДС;
	
	Если (СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
		ИЛИ СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		ИЛИ НЕ ЗначениеЗаполнено(СтатьяДДС)) Тогда
		
		Если ВидОперацииПрочееСписание = Перечисления.ВидыОперацийРасходСоСчета.Покупателю Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееСписание = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам);
		Иначе
			Возврат Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НоваяСтатьяДДС;
	
КонецФункции

#КонецОбласти

#Область ХозяйственныеОперацииПоступленияИСписания

Функция ПолучитьСписокХозОперацийПоступленияДС() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПокупателя);
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Прочее, НСтр("ru = 'Прочее поступление'")); // Прочее.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПоставщика, НСтр("ru = 'От поставщика (возврат)'"));
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РасчетыПоКредитам, НСтр("ru = 'Расчеты по кредитам'")); // Прочие расчеты.
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратЗаймаСотрудником); // Прочие расчеты.
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПокупкаВалюты);
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПрочиеРасчеты, НСтр("ru = 'Прочие расчеты'")); // Прочие расчеты.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПодотчетника);
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыПоКартам); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Налоги);
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РозничнаяВыручка);
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РозничнаяВыручкаСуммовойУчет);
	КонецЕсли;
	
	Если ДвижениеДенежныхСредствСервер.ОрганизацияИндивидуальныйПредпринимательСуществует() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ЛичныеСредстваПредпринимателя);
	КонецЕсли; 
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ПолучитьСписокХОзОперацийРасходДС() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Поставщику, НСтр("ru = 'Поставщику'"));
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.НаРасходы, НСтр("ru = 'На расходы'"));
	
	// Зарплата по ведомости
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Зарплата, НСтр("ru = 'Зарплата по ведомости'"));
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ЗарплатаСотруднику, НСтр("ru = 'Зарплата сотруднику'"));
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПрочиеРасчеты, НСтр("ru = 'Прочие расчеты'")); // Прочие расчеты.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Покупателю, НСтр("ru = 'Покупателю (возврат)'"));
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РасчетыПоКредитам, НСтр("ru = 'Расчеты по кредитам'")); // Прочие расчеты.
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВыдачаЗаймаСотруднику); // Прочие расчеты.
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Прочее, НСтр("ru = 'Прочий расход'")); // Прочее.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Подотчетнику); // Подотчетнику.
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыНаПлатежныеКарты, НСтр("ru = 'Отчет эквайрера'")); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Налоги, НСтр("ru = 'Налоги'")); // Налоги.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.КомиссияБанка, НСтр("ru='Комиссия банка'")); // Комиссия.
	
	Если Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеВКассуККМ);
	КонецЕсли;
	
	Если ДвижениеДенежныхСредствСервер.ОрганизацияИндивидуальныйПредпринимательСуществует() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ЛичныеСредстваПредпринимателя);
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

#КонецОбласти

Функция ПолучитьСтатьюДДСПоУмолчаниюДляСтрокиРасшифровки(Договор, ДокументПланирования = Неопределено, СтатьяДДС = Неопределено) Экспорт
	
	// Статья в заявке на расход (РасходДСПЛан) приоритетнее.
	Если ЗначениеЗаполнено(ДокументПланирования) Тогда
		Возврат СтатьяДДС;
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		Возврат Договор.СтатьяДДСПоУмолчанию;
	Иначе
		Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьДанныеРасшифровкаПлатежаДоговорПриИзменении()

Функция ПолучитьОстатокНаСчете(БанковскийСчет, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(
		|			,
		|			Организация = &Организация И
		|				БанковскийСчетКасса = &БанковскийСчет) КАК ДенежныеСредстваОстатки";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаВалОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ЗаголовокНадписиОстатковДС(СчетКасса, Организация, ОстатокДенежныхСредств = 0, Знач Валюта = Неопределено) Экспорт
	
	КрупныйШрифт = Новый Шрифт(,11);
	МелкийШрифт  = Новый Шрифт(,8);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетКасса", СчетКасса);
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(Организация));
	Запрос.УстановитьПараметр("ПоВсемВалютам", Валюта = Неопределено);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваОстатки.СуммаВалОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			,
	|			Организация = &Организация
	|				И БанковскийСчетКасса = &СчетКасса
	|				И (&ПоВсемВалютам
	|					ИЛИ Валюта = &Валюта)) КАК ДенежныеСредстваОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.Сумма;
		Валюта = Выборка.Валюта;
	Иначе
		Сумма = 0;
		Если ТипЗнч(СчетКасса) = Тип("СправочникСсылка.Кассы") Тогда
			Валюта = СчетКасса.ВалютаПоУмолчанию;
		Иначе
			Валюта = СчетКасса.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;
	
	ОстатокДенежныхСредств = Сумма;
	
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Остаток'") + " ", КрупныйШрифт));
	
	СуммаСтрокой = Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
	КомпонентыЧисла = Новый Массив;
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя), КрупныйШрифт));
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1), МелкийШрифт));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла, , , , "Остаток"));
	
	КомпонентыФС.Добавить(" " + Валюта.СимвольноеПредставление);
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС, , ЦветаСтиля.ТекстВторостепеннойНадписи);
	
КонецФункции

&НаСервере
Функция ДанныеВыбораНалогаПоКБК(Знач КодБК) Экспорт
	
	Возврат Справочники.ВидыНалогов.ДанныеВыбораПоКБК(КодБК);
	
КонецФункции

// Заполняет переданный список доступными видами операций по типу документа
//
// Параметры:
//   ВидДокумента - Строка - Строковое представление вида документа
//   СписокВыбора - СписокЗначений - Список, который используется для хранения видов операций
//
Процедура ЗаполнитьСписокВыбораВидовОпераций(ВидДокумента, СписокВыбора) Экспорт
	
	СтруктурыОпераций = ДвижениеДенежныхСредствСервер.ПолучитьСтруктурыОперацийДенежныеСредства(ВидДокумента);
	
	СписокВыбора.Очистить();
	
	Для каждого Операция Из СтруктурыОпераций Цикл
		СписокВыбора.Добавить(Операция.ЗначениеПеречисления, Операция.Представление);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
